# features資料庫
教育程度=["國小畢業", "國小肄業", "初中畢業", "初中肄業", "國中畢業", "國中肄業"]
f1=[]
罪責1=["為累犯", "行經行人穿越道不依規定", "道路交通管理處罰條例第86條"]
罪責2=["爰依刑法第62條前段之規定", "符合自首要件", "瘖啞人士", "爰依刑法第20條規定減輕其刑", "爰依刑法第20條之規定減輕其刑", "刑法第59條規定之酌量減輕其刑", "自承其為肇事者", "與自首要件相符", "並願接受裁判", "發覺之前即自首", "嗣並接受裁判", "承認為肇事人而接受裁判", "客觀上足以引起一般同情"]
f2=[]
nf2=0
傷害方式=["以頭撞擊", "持筆刺", "劃向", "揮砍", "分持安全帽、木棍", "持安全帽", "持木棍", "持球棒攻擊", "以安全帽攻擊", "持甩棍毆打", "持水煙管毆打", "持竹棍毆打", "持剪刀", "刺擊", "刺中"]
f3=[]
下手力道=["力道非輕", "下手力道甚猛", "左手用力揮擊", "右手用力揮擊", "手段暴戾", "犯罪情節非輕"]
f4=[]
攻擊部位=["朝人體要害攻擊", "朝人體要害之告訴人頭部攻擊"]
f5=[]
傷害結果1=["閉鎖性骨折", "牙齒斷裂", "所受傷勢尚非甚鉅", "腓骨遠端骨折", "腓骨非移位線性骨折", "腓骨外踝非移位閉鎖性骨折", "傷勢非輕", "受傷非輕", "下顎骨骨折", "齒裂", "橈神經裂傷", "肌腱斷裂", "深度撕裂傷", "近端骨折", "橈神經撕裂傷", "所受傷害及遭強制程度非鉅", "掌骨骨折", "所受傷害非重", "所受傷害非鉅", "傷勢非重", "傷勢非鉅", "腸繫膜血腫", "穿刺傷", "刺傷", "肋骨骨折", "閉鎖性骨折合併韌帶撕裂"]
傷害結果2=["癲癇症", "顱骨穹窿開放性骨折併氣顱症", "小腸穿孔併血腹", "腹壁穿刺傷", "穿刺傷合併氣血胸", "小腸穿孔", "交通性水腦症", "十二指腸撕裂傷併後腹腔出血", "失語症", "頭部外傷併顱骨骨折", "顱內出血", "脛腓骨骨幹骨折"]
f6=[]
nf6=0
犯後態度1=["素行尚佳", "態度良好", "已見悔意", "向告訴人道歉", "尚能正視所為之不法", "深感後悔", "感到抱歉", "犯後態度尚佳", "素行良好", "主動傳訊息向告訴人道歉", "素行尚稱良好", "主動與告訴人聯絡並道歉"]
犯後態度2=["犯後態度不佳", "未見悔意", "態度不佳", "未能正視所為之不法", "矢口否認有何傷害犯行", "空言否認犯行", "顯屬推託卸責之詞", "絲毫未見悔意", "犯後態度明顯不佳", "卸責之詞", "飾詞卸責", "難認其有何悔意", "難認其有何悔意", "矢口否認有何過失"]
f7=[]
nf7=0
坦承情況1=["自始未坦承犯罪", "未坦承犯罪", "矢口否認", "矢口否認犯行", "始終否認犯行", "否認犯罪", "顯屬卸責之詞", "被告否認犯罪", "矢口卸責", "否認其犯行"]
坦承情況2=["先否認犯行", "才坦承犯行"]
f8=[]
nf8=0
賠償狀況1=["賠償完畢"]	
賠償狀況2=["依約賠償中"]
f9=[]
nf9=0
經濟狀況=["經濟貧寒", "家境困難"]
f10=[]
被告身心狀況=["癲癇症", "良性陣發性眩暈", "頸椎退化性脊椎炎", "高血壓", "雙相情緒障礙症", "重度身心障礙", "輕度身心障礙", "中度身心障礙", "欠缺自我情緒管理能力", "瘖啞人士", "精神障礙", "心智缺陷", "領有身心障礙證明"]
f11=[]
被害身心狀況=["癲癇症", "頸椎退化性脊椎炎", "高血壓", "雙相情緒障礙症", "重度身心障礙", "輕度身心障礙", "中度身心障礙"]
f12=[]
和解狀況1=["無法達成和、調解", "無法達成和解", "無法達成調解", "告訴人無和解意願", "有與告訴人和解之意願", "沒有要跟被告和解", "未與告訴人達成和解", "未與告訴人達成調解", "未與告訴人達成調、和解", "未與告訴人達成和、調解", "未與告訴人和解", "願與告訴人和解", "未取得告訴人之原諒", "未取得告知人原諒", "未能獲告訴人原諒", "未能達成民事和解", "未達成和解", "告訴人並無調解意願", "無法與告訴人達成賠償金額合意", "告訴人嗣後表明無調解意願", "告訴人表明無調解意願", "尚未與告訴人達成民事賠償"]
和解狀況2=["已與告訴人和解", "表示願原諒被告", "達成和解"]
f13=[]
nf13=0
告訴人和被告人之關係=["家庭成員關係", "有家庭暴力防治法第3條第4款規定之家庭成員關係", "有家庭暴力防治法第3條第1款規定之家庭成員關係", "有家庭暴力防治法第3條第2款規定之家庭成員關係", "有家庭暴力防治法第3條第3款規定之家庭成員關係", "有家庭暴力防治法第3條第1款所定之家庭成員關係", "有家庭暴力防治法第3條第2款所定之家庭成員關係", "有家庭暴力防治法第3條第3款所定之家庭成員關係"]
f14=[]
法官心證=["未達於通常一般人不致有所懷疑", "未達於一般人不致有所懷疑", "無足採酌", "犯後態度方面難以對被告為有利之考量"]
f15=[]


# features_encoding
content=content.loc[:,"內文欄位"]
for con in content:
    nf2=0
    nf6=0
    nf7=0
    nf8=0
    nf9=0
    nf13=0
    for a in 教育程度:
        if a in con:
            f1.append(1)
            break
    else:
        f1.append(0)
    for b1 in 罪責1:
        if b1 in con:
            f2.append(1)
            nf2=1
            break
    if nf2 != 1:
        for b2 in 罪責2:
          if b2 in con:
            f2.append(2)
            nf2=2
            break
    elif nf2 == 0:
        f2.append(0)
    for c in 傷害方式:
        if c in con:
            f3.append(1)
            break
    else:
        f3.append(0)
    for d in 下手力道:
        if d in con:
            f4.append(1)
            break
    else:
        f4.append(0)
    for e in 攻擊部位:
        if e in con:
            f5.append(1)
            break
    else:
        f5.append(0)
    for f in 傷害結果2:
        if f in con:
            f6.append(2)
            nf6=2
            break
    if nf6 != 2:
        for f in 傷害結果1:
          if f in con:
            f6.append(1)
            nf6=1
            break
    elif nf6 == 0:
        f6.append(0)
    for g2 in 犯後態度2:
        if g2 in con:
            f7.append(2)
            nf7=2
            break
    if nf7 != 2:
        for g1 in 犯後態度1:
          if g1 in con:
            f7.append(1)
            nf7=1
            break
    elif nf7 == 0:
        f7.append(0)
    for h2 in 坦承情況2:
        if h2 in con:
            f8.append(2)
            nf8=2
            break
    if nf8 != 2:
        for h1 in 坦承情況1:
          if h1 in con:
            f8.append(1)
            nf8=1
            break
    elif nf8 == 0:
        f8.append(0)
    for i2 in 賠償狀況2:
        if i2 in con:
            f9.append(2)
            nf9=2
            break
    if nf9 != 2:
        for i1 in 賠償狀況1:
          if i1 in con:
            f9.append(1)
            nf9=1
            break
    elif nf9 == 0:
        f9.append(0)
    for j in 經濟狀況:
        if j in con:
            f10.append(1)
            break
    else:
        f10.append(0)
    for k in 被告身心狀況:
        if k in con:
            f11.append(1)
            break
    else:
        f11.append(0)
    for l in 被害身心狀況:
        if l in con:
            f12.append(1)
            break
    else:
        f12.append(0)
    for m2 in 和解狀況2:
        if m2 in con:
            f13.append(2)
            nf13=2
            break
    if nf13 != 2:
        for m1 in 和解狀況1:
          if m1 in con:
            f13.append(1)
            nf13=1
            break
    elif nf13 == 0:
        f13.append(0)
    for n in 告訴人和被告人之關係:
        if n in con:
            f14.append(1)
            break
    else:
        f14.append(0)
    for o in 法官心證:
        if o in con:
            f15.append(1)
            break
    else:
        f15.append(0)